In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter

In [2]:
data = pd.read_csv('/Users/vramich/Documents/SF/Unit_1_edit_data/project_1/movie_bd_v5.xls')
data.sample(5).T

,1016,1246,222,1519,1663
imdb_id,tt1673434,tt1321870,tt1647668,tt0406816,tt0345074
budget,120000000,60000000,25000000,70000000,20000000
revenue,829000000,105200903,38307627,55011732,11341016
original_title,The Twilight Saga: Breaking Dawn - Part 2,Gangster Squad,Million Dollar Arm,The Guardian,Connie and Carla
cast,Kristen Stewart|Robert Pattinson|Taylor Lautne...,Sean Penn|Ryan Gosling|Emma Stone|Josh Brolin|...,Jon Hamm|Bill Paxton|Lake Bell|Suraj Sharma|Aa...,Kevin Costner|Ashton Kutcher|Sela Ward|Melissa...,Nia Vardalos|Toni Collette|David Duchovny|Step...
director,Bill Condon,Ruben Fleischer,Craig Gillespie,Andrew Davis,Michael Lembeck
tagline,The epic finale that will live forever,No Names. No Badges. No Mercy.,"Sometimes to win, sometimes you have to change...",How Do You Decide Who Lives Or Who Dies?,"When you follow your dream, there's no telling..."
overview,"After the birth of Renesmee, the Cullens gathe...","Los Angeles, 1949. Ruthless, Brooklyn-born mob...","In a last-ditch effort to save his career, spo...",A high school swim champion with a troubled pa...,After accidentally witnessing a mafia hit in t...
runtime,115,113,124,139,98
genres,Adventure|Fantasy|Drama|Romance,Crime|Drama|Action|Thriller,Drama,Action,Comedy
production_companies,Summit Entertainment|Sunswept Entertainment|Te...,Village Roadshow Pictures|Lin Pictures|Warner ...,Walt Disney Pictures,Contrafilm|Firm Films|Touchstone Pictures|Beac...,Universal Pictures
release_date,11/13/2012,1/10/2013,5/9/2014,9/28/2006,4/16/2004
vote_average,6.1,6.1,6.6,7,6.8
release_year,2012,2013,2014,2006,2004

In [3]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1889 entries, 0 to 1888
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   imdb_id               1889 non-null   object
 1   budget                1889 non-null   int64
 2   revenue               1889 non-null   int64
 3   original_title        1889 non-null   object
 4   cast                  1889 non-null   object
 5   director              1889 non-null   object
 6   tagline               1889 non-null   object
 7   overview              1889 non-null   object
 8   runtime               1889 non-null   int64
 9   genres                1889 non-null   object
 10  production_companies  1889 non-null   object
 11  release_date          1889 non-null   object
 12  vote_average          1889 non-null   float64
 13  release_year          1889 non-null   int64
dtypes: float64(1), int64(4), object(9)
memory usage: 206.7+ KB

In [5]:
answers = {} # создадим словарь для ответов

#the time given in the dataset is in string format.
#So we need to change this in datetime format
# ...

In [6]:
#create new column 'profit': profit = revenue- budget
data['profit'] = data['revenue'] - data['budget']

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [7]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
#answers['1'] = '2. Spider-Man 3 (tt0413300)'
# запишите свой вариант ответа
answers['1'] = 'Pirates of the Caribbean: On Stranger Tides'
# если ответили верно, можете добавить комментарий со значком "+"

In [8]:
#data.columns
s = data[['original_title','budget']].sort_values(by='budget', ascending=False)
s.iloc[0] # option one to show the resule
#s.head(1) # option two

original_title    Pirates of the Caribbean: On Stranger Tides
budget                                              380000000
Name: 723, dtype: object

ВАРИАНТ 2

In [0]:
# можно добавлять разные варианты решения

# 2. Какой из фильмов самый длительный (в минутах)?

In [9]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = 'Gods and Generals'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides', '2': 'Gods and Generals'}

In [10]:
data.columns

Index(['imdb_id', 'budget', 'revenue', 'original_title', 'cast', 'director',
       'tagline', 'overview', 'runtime', 'genres', 'production_companies',
       'release_date', 'vote_average', 'release_year', 'profit'],
      dtype='object')

In [11]:
s = data[['original_title', 'runtime']].sort_values(by='runtime',ascending=False)
s.head(5)

                                     original_title  runtime
1157                              Gods and Generals      214
1081  The Lord of the Rings: The Return of the King      201
1736                                     Grindhouse      191
1336                                      King Kong      187
504                                    Pearl Harbor      183

# 3. Какой из фильмов самый короткий (в минутах)?

In [12]:
s.tail(5)

            original_title  runtime
1408               Valiant       76
1626     Home on the Range       76
1097     The Jungle Book 2       72
930   Return to Never Land       72
768        Winnie the Pooh       63

In [13]:
answers['3'] = 'Winnie the Pooh' 
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh'}

# 4. Какова средняя длительность фильмов?

In [14]:
data.runtime.mean()

109.6585494970884

In [15]:
answers['4'] = '110'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110'}

# 5. Каково медианное значение длительности фильмов?

In [16]:
data.runtime.median()

107.0

In [17]:
answers['5'] = '107'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107'}

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [18]:
# лучше код получения столбца profit вынести в Предобработку что в начале
s = data[['original_title', 'profit']].sort_values(by='profit', ascending=False)
s.head()

                   original_title      profit
239                        Avatar  2544505847
3    Star Wars: The Force Awakens  1868178225
0                  Jurassic World  1363528810
4                       Furious 7  1316249360
970                  The Avengers  1299557910

In [19]:
answers['6'] = 'Avatar'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar'}

# 7. Какой фильм самый убыточный?

In [20]:
s.tail()

                    original_title     profit
1464                  Flushed Away  -84540684
958   The Adventures of Pluto Nash  -92896027
809                Mars Needs Moms -111007242
1616                     The Alamo -119180039
1245               The Lone Ranger -165710090

In [21]:
answers['7'] = 'The Lone Ranger'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger'}

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [22]:
s = data[data.profit>0]
len(s)

1478

In [23]:
answers['8'] = '1478'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478'}

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [24]:
data.columns

Index(['imdb_id', 'budget', 'revenue', 'original_title', 'cast', 'director',
       'tagline', 'overview', 'runtime', 'genres', 'production_companies',
       'release_date', 'vote_average', 'release_year', 'profit'],
      dtype='object')

In [25]:
s = data[data.release_year==2008].sort_values(by='profit', ascending=False)
s.head(1).T

                                                                    599
imdb_id                                                       tt0468569
budget                                                        185000000
revenue                                                      1001921825
original_title                                          The Dark Knight
cast                  Christian Bale|Michael Caine|Heath Ledger|Aaro...
director                                              Christopher Nolan
tagline                                                 Why So Serious?
overview              Batman raises the stakes in his war on crime. ...
runtime                                                             152
genres                                      Drama|Action|Crime|Thriller
production_companies  DC Comics|Legendary Pictures|Warner Bros.|Syncopy
release_date                                                  7/16/2008
vote_average                                                        8.1
release_year                                                       2008
profit                                                        816921825

In [26]:
answers['9'] = 'The Dark Knight'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight'}

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [28]:
s = data[(data.release_year > 2011) & (data.release_year < 2015)].sort_values(by='profit', ascending=True)
s.head(3).T

,1245,1214,1007
imdb_id,tt1210819,tt0790736,tt1374992
budget,255000000,130000000,60000000
revenue,89289910,61648500,8106475
original_title,The Lone Ranger,R.I.P.D.,Upside Down
cast,Johnny Depp|Armie Hammer|William Fichtner|Hele...,Jeff Bridges|Ryan Reynolds|Kevin Bacon|Stephan...,Kirsten Dunst|Jim Sturgess|Timothy Spall|James...
director,Gore Verbinski,Robert Schwentke,Juan Diego Solanas
tagline,Never Take Off the Mask,To protect and serve the living,Two worlds. One future.
overview,The Texas Rangers chase down a gang of outlaws...,A recently slain cop joins a team of undead po...,In an alternate universe where twinned worlds ...
runtime,149,96,104
genres,Action|Adventure|Western,Fantasy|Action|Comedy|Crime,Romance|Science Fiction|Drama|Fantasy
production_companies,Walt Disney Pictures|Jerry Bruckheimer Films|I...,Universal Pictures|Original Film|Dark Horse En...,Onyx Films|Studio 37|Jouror Productions|France...
release_date,7/3/2013,7/18/2013,9/27/2012
vote_average,6,5.3,6.1
release_year,2013,2013,2012
profit,-165710090,-68351500,-51893525

In [29]:
answers['10'] = 'The Lone Ranger'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger'}

# 11. Какого жанра фильмов больше всего?

In [0]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале

In [222]:
d = data[['genres', 'profit']] # create new df with only two columns (director & genres)
d['genres'] = d['genres'].str.split('|', n=-1, expand = False) # delete '|'from director column to explode
d = d.explode('genres') # explode new df d
d.groupby('genres')['genres'].agg(['count']).sort_values(by='count', ascending=False)

<ipython-input-222-4bfe95a4abb8>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d['genres'] = d['genres'].str.split('|', n=-1, expand = False) # delete '|'from director column to explode

                 count
genres
Drama              782
Comedy             683
Thriller           596
Action             582
Adventure          415
Crime              315
Romance            308
Family             260
Science Fiction    248
Fantasy            222
Horror             176
Mystery            168
Animation          139
Music               64
History             62
War                 58
Western             19
Documentary          8
Foreign              2

In [223]:
answers['11'] = 'Drama'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth'}

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [220]:
s = data[data.profit>0] #filter action films
#len(s)
d = s[['genres', 'profit']] # create new df with only two columns (director & genres)
d['genres'] = d['genres'].str.split('|', n=-1, expand = False) # delete '|'from director column to explode
d = d.explode('genres') # explode new df d
d.groupby('genres')['genres'].agg(['count']).sort_values(by='count', ascending=False)

<ipython-input-220-33f306f6ad6e>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d['genres'] = d['genres'].str.split('|', n=-1, expand = False) # delete '|'from director column to explode

                 count
genres
Drama              560
Comedy             551
Thriller           446
Action             444
Adventure          337
Romance            242
Crime              231
Family             226
Science Fiction    195
Fantasy            188
Horror             150
Animation          120
Mystery            119
Music               47
History             46
War                 41
Western             12
Documentary          7

In [221]:
answers['12'] = 'Drama'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Comedy',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth'}

# 13. У какого режиссера самые большие суммарные кассовые сбооры?

In [44]:
data.columns

Index(['imdb_id', 'budget', 'revenue', 'original_title', 'cast', 'director',
       'tagline', 'overview', 'runtime', 'genres', 'production_companies',
       'release_date', 'vote_average', 'release_year', 'profit'],
      dtype='object')

In [46]:
data.groupby('director')['revenue'].agg(['sum']).sort_values(by='sum', ascending=False)

                          sum
director
Peter Jackson      6490593685
Christopher Nolan  4167548502
David Yates        4154295625
Michael Bay        3886938960
J.J. Abrams        3579169916
...                       ...
David MichÃ´d         2295423
Steven Shainberg      2281089
Paul Schrader         2062066
Keanu Reeves          2054941
Simon Hunter          2033165

[957 rows x 1 columns]

In [47]:
answers['13'] = 'Peter Jackson'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Comedy',
 '12': 'Comedy',
 '13': 'Peter Jackson'}

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [191]:
s = data[data.genres.str.contains('Action', na=False)] #filter action films
#len(s)
d = s[['director', 'genres']] # create new df with only two columns (director & genres)
d['director'] = d['director'].str.split('|', n=-1, expand = False) # delete '|'from director column to explode
d = d.explode('director') # explode new df d
d.groupby('director')['director'].agg(['count']).sort_values(by='count', ascending=False) # count directors

<ipython-input-191-4fe8b5fae0a7>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d['director'] = d['director'].str.split('|', n=-1, expand = False) # delete '|'from director column to explode

                    count
director
Robert Rodriguez        9
Michael Bay             7
Paul W.S. Anderson      7
Ridley Scott            6
Antoine Fuqua           6
...                   ...
John Whitesell          1
Brian A Miller          1
Jon Amiel               1
Jon Avnet               1
Luis Mandoki            1

[364 rows x 1 columns]

In [192]:
answers['14'] = 'Robert Rodriguez'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Comedy',
 '12': 'Comedy',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez'}

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [66]:
data.columns

Index(['imdb_id', 'budget', 'revenue', 'original_title', 'cast', 'director',
       'tagline', 'overview', 'runtime', 'genres', 'production_companies',
       'release_date', 'vote_average', 'release_year', 'profit'],
      dtype='object')

In [201]:
s = data[data.release_year==2012]
s = s[['cast', 'original_title', 'revenue']]
s.head(2)

,cast,original_title,revenue
970,Robert Downey Jr.|Chris Evans|Mark Ruffalo|Chr...,The Avengers,1519557910
971,Kate Beckinsale|Stephen Rea|Michael Ealy|Theo ...,Underworld: Awakening,132400000

In [209]:
s = data[data.release_year==2012] # filters all films released in the year 2012
s = s[['cast', 'original_title', 'revenue']] # create new df with only relevant columns
s['cast'] = s['cast'].str.split('|', n=-1, expand = False)
s = s.explode('cast')
s.groupby('cast')['revenue'].agg(['sum']).sort_values(by='sum', ascending=False)

                          sum
cast
Chris Hemsworth    2027450773
Denis Leary        1629460639
Anne Hathaway      1522851057
Robert Downey Jr.  1519557910
Mark Ruffalo       1519557910
...                       ...
Michael Nyqvist       3428048
Danny Huston          2106557
Josh Lucas            2106557
Sami Gayle            2106557
Nicolas Cage          2106557

[466 rows x 1 columns]

In [224]:
answers['15'] = 'Chris Hemsworth'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth'}

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [227]:
s = data[(data.budget) > (data.budget.mean())] # filter data set with high budget

s = s[['cast', 'budget']] # create new df with only relevant columns
s['cast'] = s['cast'].str.split('|', n=-1, expand = False)
s = s.explode('cast')
s.groupby('cast')['budget'].agg(['count']).sort_values(by='count', ascending=False)

                         count
cast
Matt Damon                  18
Adam Sandler                17
Angelina Jolie              16
Tom Cruise                  15
Eddie Murphy                15
...                        ...
Jennifer Hudson              1
Jennifer Jason Leigh         1
Jennifer Saunders            1
Jennifer Tilly               1
Ã“lafur Darri Ã“lafsson      1

[1505 rows x 1 columns]

In [228]:
answers['16'] = 'Matt Damon'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon'}

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [247]:
s = data[['cast', 'genres']]
s.head(3)
s['cast'] = s['cast'].str.split('|', n=-1, expand=False)
s['genres'] = s['genres'].str.split('|', n=-1, expand=False)
s = s.explode('cast')
s = s.explode('genres')
s = s[s.cast=='Nicolas Cage']
s.groupby('genres')['cast'].agg(['count']).sort_values(by='count', ascending=False)

<ipython-input-247-2d5c824826d1>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s['cast'] = s['cast'].str.split('|', n=-1, expand=False)
<ipython-input-247-2d5c824826d1>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s['genres'] = s['genres'].str.split('|', n=-1, expand=False)

                 count
genres
Action              17
Thriller            15
Drama               12
Crime               10
Fantasy              8
Adventure            7
Comedy               6
Science Fiction      4
Animation            3
Family               3
Mystery              3
History              2
Horror               1
Romance              1
War                  1

In [249]:
answers['17'] = 'Action'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action'}

# 18. Самый убыточный фильм от Paramount Pictures

In [271]:
s = data[['production_companies', 'original_title', 'profit']]
s['production_companies'] = s['production_companies'].str.split('|', n=-1, expand=False)
s = s.explode('production_companies')
s = s[s.production_companies=='Paramount Pictures']
s.sort_values(by='profit', ascending=True).head(1)

<ipython-input-271-2a040a8e3f66>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s['production_companies'] = s['production_companies'].str.split('|', n=-1, expand=False)

    production_companies        original_title    profit
925   Paramount Pictures  K-19: The Widowmaker -64831034

In [273]:
answers['18'] = 'K-19: The Widowmaker'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker'}

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [276]:
data.groupby('release_year')['revenue'].agg(['sum']).sort_values(by='sum', ascending=False).head(1)

                      sum
release_year
2015          25449202382

In [277]:
answers['19'] = '2015'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015'}

# 20. Какой самый прибыльный год для студии Warner Bros?

In [303]:
data[data.production_companies.str.contains('Warner Bros', na=False)] \
        .groupby('release_year')['profit'] \
        .agg(['sum']) \
        .sort_values(by='sum', ascending=False)

                     sum
release_year
2014          2295464519
2007          2201675217
2008          2134595031
2010          1974712985
2011          1871393682
2003          1855493377
2009          1822454136
2013          1636453400
2004          1631933725
2005          1551980298
2001          1343545668
2012          1258020056
2002          1022709901
2015           870368348
2006           620170743
2000           452631386

In [304]:
answers['20'] = '14'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14'}

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [306]:
data.head(1).T

                                                                      0
imdb_id                                                       tt0369610
budget                                                        150000000
revenue                                                      1513528810
original_title                                           Jurassic World
cast                  Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...
director                                                Colin Trevorrow
tagline                                               The park is open.
overview              Twenty-two years after the events of Jurassic ...
runtime                                                             124
genres                        Action|Adventure|Science Fiction|Thriller
production_companies  Universal Studios|Amblin Entertainment|Legenda...
release_date                                                   6/9/2015
vote_average                                                        6.5
release_year                                                       2015
profit                                                       1363528810

In [313]:
s = data[['release_date', 'original_title']]
s['month'] = pd.DatetimeIndex(s['release_date']).month #extract month into new column

s.groupby('month')['original_title'].agg(['count']).sort_values(by='count', ascending=False)

<ipython-input-313-890cbe37020b>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s['month'] = pd.DatetimeIndex(s['release_date']).month #extract month into new column

       count
month
9        227
12       190
10       186
8        161
3        156
4        149
6        147
11       146
7        142
5        140
2        135
1        110

In [315]:
answers['21'] = 'Сентябрь'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь'}

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [322]:
s = data[['release_date', 'original_title']]
s['month'] = pd.DatetimeIndex(s['release_date']).month # extract month into new column
s = s[(s.month == 6) | (s.month == 7) | (s.month == 8)] # exctract summer month
s.month.count()
print(len(s))

450

<ipython-input-322-c407d6a6039f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s['month'] = pd.DatetimeIndex(s['release_date']).month # extract month into new column

In [323]:
answers['22'] = '450'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь',
 '22': '450'}

# 23. Для какого режиссера зима – самое продуктивное время года?

In [328]:
s = data[['director', 'release_date', 'original_title']]
s['month'] = pd.DatetimeIndex(s['release_date']).month # extract month into new column
s = s[(s.month == 12) | (s.month == 1) | (s.month == 2)] # exctract summer month
s['director'] = s['director'].str.split('|', n=-1, expand=False)
s = s.explode('director')
s.groupby('director')['original_title'].agg(['count']).sort_values(by='count', ascending=False).head(1)

<ipython-input-328-2aeff0674a87>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s['month'] = pd.DatetimeIndex(s['release_date']).month # extract month into new column

               count
director
Peter Jackson      7

In [329]:
answers['23'] = 'Peter Jackson'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь',
 '22': '450',
 '23': 'Peter Jackson'}

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [330]:
data.columns

Index(['imdb_id', 'budget', 'revenue', 'original_title', 'cast', 'director',
       'tagline', 'overview', 'runtime', 'genres', 'production_companies',
       'release_date', 'vote_average', 'release_year', 'profit'],
      dtype='object')

In [357]:
s = data[['production_companies', 'original_title']]
s['production_companies'] = s['production_companies'].str.split('|', n=-1, expand=False)
s = s.explode('production_companies')
s['title_length'] = s.original_title.apply(lambda x: len(x))
s.groupby('production_companies')['title_length'].agg(['mean']).sort_values(by='mean', ascending=False).head(20)

<ipython-input-357-0722c8be5d8e>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s['production_companies'] = s['production_companies'].str.split('|', n=-1, expand=False)

                                mean
production_companies
Four By Two Productions         83.0
Jim Henson Company, The         59.0
Dos Corazones                   47.0
Polsky Films                    46.0
Museum Canada Productions       46.0
The Saul Zaentz Company         43.0
Lucasfilm                       41.5
Total Entertainment             41.0
Second Mate Productions         41.0
Harry Potter Publishing Rights  41.0
Zohar International             41.0
Cool Music                      41.0
3Foot7                          41.0
Iron Film                       41.0
TSBD Canada Productions         41.0
Ozumi Films                     40.0
Propeler                        40.0
P of A Productions Limited      40.0
United Plankton Pictures        40.0
Nickelodeon Animation Studios   40.0

In [342]:
answers['24'] = 'Four By Two Productions'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь',
 '22': '450',
 '23': 'Peter Jackson',
 '24': 'Four By Two Productions'}

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [362]:
s = data[['production_companies', 'overview']]
s.production_companies = s.production_companies.str.split('|', n=-1, expand=False)
s = s.explode('production_companies')
s['overview_words'] = s.overview.str.count(' ') + 1
#s.sort_values(by='overview_words', ascending=False).head(5)
s.groupby('production_companies')['overview_words'].agg(['mean']).sort_values(by='mean', ascending=False)

                                        mean
production_companies
Midnight Picture Show                  175.0
Heineken Branded Entertainment         161.0
Room 9 Entertainment                   161.0
98 MPH Productions                     159.0
Brookwell-McNamara Entertainment       156.0
...                                      ...
Henceforth                              13.0
Our Stories Films                       13.0
London Boulevard                        13.0
Motion Picture Corporation of America   11.0
Empire Pictures                         11.0

[1771 rows x 1 columns]

In [364]:
answers['25'] = 'Midnight Picture Show'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь',
 '22': '450',
 '23': 'Peter Jackson',
 '24': 'Four By Two Productions',
 '25': 'Midnight Picture Show'}

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [406]:
s = data[['original_title', 'vote_average']]
d = s.groupby('vote_average')['vote_average'].agg(['count']).sort_values(by='vote_average', ascending=False)
d['rel_cumsum'] = d['count'].cumsum()/sum(d['count'])

best_vote = d[d.rel_cumsum<=0.01]

s[s.vote_average >= 7.9].sort_values(by='vote_average', ascending=False)

                                     original_title  vote_average
599                                 The Dark Knight           8.1
9                                        Inside Out           8.0
34                                             Room           8.0
118                                    Interstellar           8.0
125                              The Imitation Game           8.0
119                         Guardians of the Galaxy           7.9
128                                       Gone Girl           7.9
138                        The Grand Budapest Hotel           7.9
370                                       Inception           7.9
872                                     The Pianist           7.9
1081  The Lord of the Rings: The Return of the King           7.9
1183                        The Wolf of Wall Street           7.9
1191                               12 Years a Slave           7.9
1800                                        Memento           7.9

In [408]:
answers['26'] = 'Inside Out, The Dark Knight, 12 Years a Slave'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь',
 '22': '450',
 '23': 'Peter Jackson',
 '24': 'Four By Two Productions',
 '25': 'Midnight Picture Show',
 '26': 'Inside Out, The Dark Knight, 12 Years a Slave'}

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [478]:
s = data[['cast', 'original_title']]
s['list_of_actors'] = s['cast'].str.split('|', n=-1, expand=False)
s['combis'] = s['list_of_actors'].apply(lambda x: list(combinations(x, 2)))
s = s.explode('combis')
ss.groupby('combis')['combis'].agg(['count']).sort_values(by='count', ascending=False)

                                     count
combis
(Daniel Radcliffe, Rupert Grint)        80
(Daniel Radcliffe, Emma Watson)         80
(Rupert Grint, Emma Watson)             70
(Johnny Depp, Helena Bonham Carter)     60
(Ben Stiller, Owen Wilson)              60
...                                    ...
(Dennis Farina, Daniel Baldwin)          6
(Freddie Prinze Jr., Amanda Detmer)      6
(Robert De Niro, Milla Jovovich)         6
(Robin Tunney, Daniel Baldwin)           6
(Cole Hauser, Daniel Baldwin)            6

[18121 rows x 1 columns]

In [480]:
answers['27'] = '(Daniel Radcliffe, Rupert Grint'
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь',
 '22': '450',
 '23': 'Peter Jackson',
 '24': 'Four By Two Productions',
 '25': 'Midnight Picture Show',
 '26': 'Inside Out, The Dark Knight, 12 Years a Slave',
 '27': '(Daniel Radcliffe, Rupert Grint'}

ВАРИАНТ 2

# Submission

In [481]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides',
 '2': 'Gods and Generals',
 '3': 'Winnie the Pooh',
 '4': '110',
 '5': '107',
 '6': 'Avatar',
 '7': 'The Lone Ranger',
 '8': '1478',
 '9': 'The Dark Knight',
 '10': 'The Lone Ranger',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '14',
 '21': 'Сентябрь',
 '22': '450',
 '23': 'Peter Jackson',
 '24': 'Four By Two Productions',
 '25': 'Midnight Picture Show',
 '26': 'Inside Out, The Dark Knight, 12 Years a Slave',
 '27': '(Daniel Radcliffe, Rupert Grint'}

In [482]:
# и убедиться что ни чего не пропустил)
len(answers)

27